In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30
float_formatter = "฿{:,.2f}"

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 7, 14), datetime.date(2023, 7, 13))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 7, 14), datetime.date(2023, 7, 13))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(2)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-07-14
Today in mm-dd format: 07-14
yesterday: 2023-07-12 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-07-12 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1    JASIF  130000
1       1      MCS   78000
2       1    PTTGC    6000
3       1      TMT   36000
4       2      ASK    4500
5       2      ASP   30000
6       2  CPNREIT   60000
7       2      DIF   30000
8       2   GVREIT   30000
9       2      NER   27000
10      2      ORI   45000
11      2      RCL   27000
12      2     SENA  105000
13      2      STA    5000
14      2    TFFIF   10000
15      2    WHAIR   50000
16      2    WHART   30000
17      3      BBL     400
18      3      IVL    7200
19      3      JMT    6000
20      3      SCC     600
21      4       AH    1200
22      4      AWC    9000
23      4      BCH   15000
24      4     ICHI    1500
25      4    JMART   10800
26      4      KCE   10000
27      4      PTG    3600
28      4   SINGER    6000
29      4    SYNEX   15000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-07-14'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1      JASIF     130000   22-12-30   23-07-14       8.05       6.95      -1.10     -13.66 -143,000.00        -22
         1        MCS      78000   22-12-30   23-07-14       8.95       6.35      -2.60     -29.05 -202,800.00        -52
         1      PTTGC       6000   22-12-30   23-07-14      47.25      40.50      -6.75     -14.29 -40,500.00        -27
         1        TMT      36000   22-12-30   23-07-14       7.80       7.30      -0.50      -6.41 -18,000.00        -10
         2        ASK       4500   22-12-30   23-07-14      35.50      25.25     -10.25     -28.87 -46,125.00        -41
         2        ASP      30000   22-12-30   23-07-14       2.98       2.78      -0.20      -6.71  -6,000.00        -10
         2    CPNREIT      60000   22-12-30   23-07-14      19.50      10.90      -8.60     -44.10 -516,000.00        -86
         2        DIF      30000   22-12-30   23-07-14      13.20      10.70      -2.50     -18.94 -75,000.00        -25
         2     GVREIT      30000   22-12-30   23-07-14       9.10       8.40      -0.70      -7.69 -21,000.00        -14
         2        NER      27000   22-12-30   23-07-14       6.35       4.56      -1.79     -28.19 -48,330.00        -49
         2        ORI      45000   22-12-30   23-07-14      12.10      10.40      -1.70     -14.05 -76,500.00        -17
         2        RCL      27000   22-12-30   23-07-14      30.75      24.20      -6.55     -21.30 -176,850.00        -31
         2       SENA     105000   22-12-30   23-07-14       3.94       3.00      -0.94     -23.86 -98,700.00        -47
         2        STA       5000   22-12-30   23-07-14      21.10      17.00      -4.10     -19.43 -20,500.00        -41
         2      TFFIF      10000   22-12-30   23-07-14       7.65       7.60      -0.05      -0.65    -500.00         -1
         2      WHAIR      50000   22-12-30   23-07-14       7.45       7.05      -0.40      -5.37 -20,000.00         -8
         2      WHART      30000   22-12-30   23-07-14      10.70      10.70       0.00       0.00       0.00          0
         3        BBL        400   22-12-30   23-07-14     148.00     158.00      10.00       6.76   4,000.00         20
         3        IVL       7200   22-12-30   23-07-14      40.75      35.25      -5.50     -13.50 -39,600.00        -22
         3        JMT       6000   22-12-30   23-07-14      69.00      35.50     -33.50     -48.55 -201,000.00       -134
         3        SCC        600   22-12-30   23-07-14     342.00     328.00     -14.00      -4.09  -8,400.00        -14
         4         AH       1200   22-12-30   23-07-14      29.75      34.00       4.25      14.29   5,100.00         17
         4        AWC       9000   22-12-30   23-07-14       6.30       4.62      -1.68     -26.67 -15,120.00        -45
         4        BCH      15000   22-12-30   23-07-14      20.50      17.50      -3.00     -14.63 -45,000.00        -30
         4       ICHI       1500   22-12-30   23-07-14      11.30      13.80       2.50      22.12   3,750.00         25
         4      JMART      10800   22-12-30   23-07-14      40.75      16.40     -24.35     -59.75 -262,980.00       -149
         4        KCE      10000   22-12-30   23-07-14      46.50      38.75      -7.75     -16.67 -77,500.00        -31
         4        PTG       3600   22-12-30   23-07-14      14.50      10.20      -4.30     -29.66 -15,480.00        -43
         4     SINGER       6000   22-12-30   23-07-14      28.75       9.10     -19.65     -68.35 -117,900.00       -183
         4      SYNEX      15000   22-12-30   23-07-14      16.40      11.80      -4.60     -28.05 -69,000.00        -46

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
4,2,ASK,4500,2022-12-30,2023-07-14,35.50,25.25,-10.25,-28.87,-46125.0,-41
21,4,AH,1200,2022-12-30,2023-07-14,29.75,34.00,4.25,14.29,5100.0,17
27,4,PTG,3600,2022-12-30,2023-07-14,14.50,10.20,-4.30,-29.66,-15480.0,-43
17,3,BBL,400,2022-12-30,2023-07-14,148.00,158.00,10.00,6.76,4000.0,20
19,3,JMT,6000,2022-12-30,2023-07-14,69.00,35.50,-33.50,-48.55,-201000.0,-134

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
16,2,WHART,30000,2022-12-30,2023-07-14,10.70,10.70,0.00,0.00,0.0,0
18,3,IVL,7200,2022-12-30,2023-07-14,40.75,35.25,-5.50,-13.50,-39600.0,-22
2,1,PTTGC,6000,2022-12-30,2023-07-14,47.25,40.50,-6.75,-14.29,-40500.0,-27
12,2,SENA,105000,2022-12-30,2023-07-14,3.94,3.00,-0.94,-23.86,-98700.0,-47
1,1,MCS,78000,2022-12-30,2023-07-14,8.95,6.35,-2.60,-29.05,-202800.0,-52

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
25,4,JMART,10800,2022-12-30,2023-07-14,40.75,16.40,-24.35,-59.75,-262980.0,-149
6,2,CPNREIT,60000,2022-12-30,2023-07-14,19.50,10.90,-8.60,-44.10,-516000.0,-86
1,1,MCS,78000,2022-12-30,2023-07-14,8.95,6.35,-2.60,-29.05,-202800.0,-52
29,4,SYNEX,15000,2022-12-30,2023-07-14,16.40,11.80,-4.60,-28.05,-69000.0,-46
2,1,PTTGC,6000,2022-12-30,2023-07-14,47.25,40.50,-6.75,-14.29,-40500.0,-27

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1       250000   72.05   61.10  -10.95   -63.41  -404300.0 -111
2       453500  180.32  142.54  -37.78  -219.16 -1105505.0 -370
3        14200  599.75  556.75  -43.00   -59.38  -245000.0 -150
4        72100  214.75  156.17  -58.58  -207.37  -594130.0 -485

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr      avr_p1      avr_p2    avr_chg    avr_spd    ttl_amt
period
1        250000   18.012500   15.275000  -2.737500 -27.750000  -404300.0
2        453500   13.870769   10.964615  -2.906154 -28.461538 -1105505.0
3         14200  149.937500  139.187500 -10.750000 -37.500000  -245000.0
4         72100   23.861111   17.352222  -6.508889 -53.888889  -594130.0

In [17]:
pl = df.amount.sum()
float_formatter.format(pl)

'฿-2,348,935.00'

In [18]:
prev_pl = -2_451_240
diff = pl - prev_pl
float_formatter.format(diff)

'฿102,305.00'